{"pages":[{"title":"Adventures","url":"adventures/","tags":"pages","text":""},{"title":"feeds","url":"feeds/","tags":"pages","text":"English feeds Italian feeds"},{"title":"index","url":"index/","tags":"pages","text":"I'm Manu, and I'm an adventurer . My main quest revolves around ecological and environmental issues, and this website is a diary of thoughts, analysis and rants, and where I document how I try to solve some problems as a permaculture designer, gardener, herbalist, IT guy and human being. Even in the most technical diaries it is nice to see drying flowers, drawings and little notes here and there, so some articles may get off rail and be about photography, videomaking and more. Adventure is also inspiration, game and fun, after all. Thanks for swinging by. Really."},{"title":"Trophies","url":"trophies/","tags":"pages","text":"icon: trophy (rimpiazza quando rimetti) This are adventures I'm most proud of and would like to highlight. I didn't really get a trophy for them, but frankly I think I should."},{"title":"Psychology of climate change pt.2","url":"ecopsych02/","tags":"misc","text":"DISCLAIMER : I am not a psychologist. I am just a curious guy, and while I'd like to share what I discovered around, I also write my opinions and I may interpret things wrong. If you want the real deal, do your own research. In the first article we quickly looked at how people perceive the climate change problem and the dynamics behind the behavior that promotes it. Depressing but, I hope, useful and with some ideas on how to use that knowledge. Now, next two points: 3: What are the psychological impacts of climate change? The way people perceive the climate change is surely interesting, but there is more than just perception: people respond to it, in a way or another, and understanding how made more clear to me how connected it is to wars, inequities and how difficult it is for people to cope with such a big idea. Access to natural environment is crucial for our psychological well-being Impact of climate change per se Climate is not just what falls down from the sky . Climate affects (even though it is not the only reason for) depletion of freshwater, loss of biodiversity, soil loss and blabla, I'm not here to scare you. By 2030 42% of the human population are expected to not have access to enough freshwater , and the ones paying the most the consequences are the poors, the developing countries and the oppressed minorities. Not only they'll have to beg for resources and shelter (like the immigrations are showing even now) but this will likely cause even more disparity and social instability , ethnic tensions, violence and conflicts. People will be forced to relocate, disrupting their existing social network, and more groups and inter-group fighting will emerge. I found very interesting the extensive study of Anderson. He argues that there is a causal relationship between heat and violence , and that the global warming may therefore make everything worst. Evolutionary this may make sense, as in a cold climate we need to cooperate more to survive, while in warm climate the scarcity of resources may favour the strong, individualistic behavior. Beside all this big and evident scenarios, the loss of biodiversity and natural resources is not just about eating and drinking: a whole lot of our psychological well being depends on living close to forests , parks and to having access to \"natural\" landscapes. There is also the more acute scenario of the catastrophic events, like tornados, droughts, floods, and football matches delayed because of bad weather. People's reaction in case of a catastrophe are the ones you may expect: anxiety, depression, increased suicidal rates, post traumatic stress disorder, alcoholism, increased child abuse, and so on. Here too, the effects are not equally distributed: poor people and less powerful minorities are the ones facing the highest psychological and practical consequences of such troubles. I highly doubt this is a fertile ground for a well designed and agreed management of the natural resources, so a feedback loop is triggered. That's how you depress people into inaction Impacts of Climate Change information I've already talked about it in the first part of this series, and this is kind of what made me go around to look for answers: why don't people give a shit? Let's be clear on this: people don't react to climate change itself , they react to the information passed by, mostly by media. So let's see how to better spread the guilt here. Well-meaning attempts to create urgency about climate change [...] frequently lead to the exact opposite of the desired response: denial, paralysis, apathy, or actions that can create greater risks than the one being mitigated. I get this, frankly. The problem is overwhelming, and no one likes to feel guilty of shameful about his lifestyle. This apathy prevents individuals from learning more about the threat and to get an informed opinion . The defense mechanisms includes the infamous splitting (when you know it but divest it of emotional meaning), and numbness. Another interesting effect I found was about the sensible people. Is not like everyone is in denial, some people feel differently, but there are barriers to their expression , such as the fear of being seen as unpatriotic, morbid or uninformed (seems like no one can talk about climate change unless he is a scientist. Talk about your feelings people! ) Any good in this? Well, kinda. Grouping together, helping victims of catastrophes, working for a higher cause and get involved in eco-friendly works seems to be really good for the psyche . The bad note is, you don't have to actually do anything useful, you just need to believe it, and as far as I can see around me most of the so called \"environmentalists\" are wasting time, money and energy in highly ineffective practices. Working notes You have to give people the right tools Don't put people in fear, apathy and anxiety because of lack of control. Information should be given as a nice puzzle to solve together with our action Every action should be as pleasant as possible and create nice group dynamics, reinforcing a loop of well-being Always give a solution . Talking about a problem is fine within scientists or passionate people, but with most of the world I should make clear that I'm proposing something they can concretely do, and see. Producing your own food, growing flowers for the insects, avoid usage of some products for example Stop saying \"you dickhead, you are killing us all with your fetish for plastic bags\" . You just create denial Making people feel guilty (in a delicate way) is not that bad, guilt is something you can perceive and work to get rid of. But never make people feel ashamed. All this said, don't try to manipulate people to make them good \"environmental soldiers\". We need educated, informed, happy people 4: How do people adapt to and cope with climate change? This questions are getting all quite alike, and are leading more or less to the same results. What this questions means: beside the perception of the risk, beside why and how they contribute and are affected(passively) by climate change, what do people do in response? Answering is difficult being climate change an abstract entity, while the stressors take many different shapes. Chronic stressors can go unnoticed and be like a background noise that does not provoke any reaction (take air pollution for example). Threat and coping appraisal How do people appraise threat , and how do they react? Perceiving the threat is a first necessary step towards taking action, but it can be fatal. A lack of personal environment control can bring to aversiveness, anxiety and distress, bringing people into apathy and denial (as said before). On the other hand, if the individual feels that he can deal with it, that he is able to address the adverse impacts with the resources he has, than it can become a challenge , and not a threat. This is a crucial step, oftentimes overlooked by media and environmental communicators: people have to feel empowered. Social factors are quite influential in this. Not just talking about media, but also interactions with friends, overheard conversations and internet messaging can have a deep effect on an individual level, and prove decisive in the coping appraisal. You are in there too. Now, does just one need to feel \"empowered\"? Probably not. Feeling part of the cause also goes a long way towards taking your responsibility and getting active. You break it, you fix it . On the other hand, even if everyone agree that the climate change is anthropogenic, they may see it as distant and may consider it to be not ones duty ('The government should fix it', 'Chinese are polluting the most' and so on). While this may seem like needing more studies, from en evolutionary/game theory standpoint is totally understandable: if someone else fixes it and you can reap the benefits without doing anything you are the winner of the situation, and it may become an evolutionary stable strategy . Much of the study is actually done in relation to community responses to climate change, as that is a clear dynamic in case of catastrophe. It highlights how important it is to have a network and people you can rely on, but let's not forget that the individual level of survival easily overrides the community dynamics, and because communities are disgregating in front of our very eyes they are prone to change radically in the next years. A positive approach is really helpful to cope with disasters Working notes Social factors are important here . Talk with people, discuss it, even if you don't see it you'll be throwing seeds in the air. Again, making the change enjoyable , making it feel like a winning strategy and also economically supporting it is of paramount importance. Working with authorities and institution can provide helpful, even though it may suck from other ethical points of view Mediate between communities , keeping yourself integrated can be useful to provide support and be there in case of damage. Yes, if a drought kicks in and you know how to cultivate in arid climates is great, but if no community knows you or likes you the benefits will be diminished by order of magnitude This is not just informing , is creating a cultural and social push in one direction. When you make talks or workshops, always encourage two way communication When communicating, consider that different groups have different need: listen and look before talking. Copyright notes the image of the fucks given that day and the depressing polar bear are not mine and are copyright of their authors. I do not know who they are, but if you have any trouble with them please let me know."},{"title":"Psychology of climate change pt.1","url":"ecopsych/","tags":"misc","text":"DISCLAIMER : I am not a psychologist. I am just a curious guy, and while I'd like to share what I discovered around, I also write my opinions and I may interpret things wrong. If you want the real deal, do your own research. Humans are actively destroying their environment. They know the consequences, and they don't really make much of an effort to change their ways. If an alien civilization came visiting us today, we'd need our best philosophers to convince them that we are not a bunch of idiots. Thing is, I don't think we are idiots. So, why do we behave in that way? I've been wondering about it a lot lately and quick, dismissive answers are not cutting the chase here, only making things more difficult. So, I started looking around for explanations. What I understood is that is not really environmental scientist who should be leading the problem solving here: is marketers, psychologists and sociologists. We already have the means to solve most of the issues, technically, problem is the communication and why/how it does not get into the cognitive pattern of the avarage Joe. As an example, is not hard to not use plastic bottles where drinkable water comes out of a tap. But a lot of people still do it. I found a few good articles, and a metric fuckton of low quality, clickbait titled others, but one that strucked me as particularly good is the climate change booklet , a 120 or so pages of review of the existing psychologic literature in the field. Seems like the American Psychology Association has put together a task force for global climate change . Good on them! The report looks through the available researches and is targeted to psychologists. I am not one, but content was very interesting nonetheless. It is focused around 6 questions, which seems quite spot on. In this article I'll make a short commentary of the first two. 1: How do people understand the risks imposed by climate change? This is crucial: if people don't feel a risk they are unlikely to act. As I said, we are not evolved to perceive all problems. Immediate, sure, controllable risks have the highest priority. What else? Climate change is not something you really experience individually . You may experience bad weather, but climate is a statistical model and the task of understanding it lies more in the hand of specialists. This requires an analytical processing of data, which we are not evolved to prioritize against associative processing. The feeling of risk is, well, a feeling, and raw data doesn't punch you in the guts as the need of something right now and when the two system disagree the affective, association based system usually prevails. Cutting consumption now to avoid a further risk in a distant future doesn't fit in most people and may even generate positions of denial. Small probability events are underestimated . Statistically a lot of people crash in cars, but when they drive they often ignore those risks The cost of mitigation is often too high . In contrast with economic analysts who typically have specific algorithms to discount future and distant costs, people often apply sharp discounts to distant costs an benefits. Getting a damage now for a return in 6 years is not impactful, just think of a 50 years benefit. In the current economic system, with a very quick turnover, is unthinkable. Global environmental systems are perceived as beyond the control of individuals . Is very difficult to feel how not eating a steak today can save a species far away, even though you may understand that it does so I found very interesting how risk perception is similar to quitting the smoking habit , in some ways. Is a distant benefit for an immediate suffering, a probability game, and more (of course, it's not the same thing and is just an analogy for some parts) Smoking is actually good for the environment: it kills humans Working notes Making the shift to less consumptive standard should give immediate benefits , not just costs. This is properly understood in permaculture principle obtain a yield . Cultivating your own food should give you food right now, not drinking in water bottles should make your water taste good. It actually does, and we should put the accent in that, beside of the obvious long-term climate impact Groups dynamics are of focal importance. People perceiving climate change risks also often share other ideas between themselves, seems. For example. Trump supporters usually don't. If we can make the environmental idea endemic to as much cultural groups as possible, we can get leverage that group spreading. For example : If I get my book reading club to organize dinners with food bought on regenerative agriculture, and collect small donations to send to ecological restoration projects, I have a positive impact. If the book club grows so will the beneficial impact of it, without any further work needed, as the benefits are now bundles in that community. You can think of it as a meme into the meme pool, and if I can keep the genetic comparison, making it a memetic linkage to other characteristics 2: What are the human behavioural contributions to climate change? This is the kind of thing that you often can't talk with people, being the ethical and moral equivalent of a minefield : birth control, consumption limitation, blocking/modulating third world development, don't get that pet. I guess that is why the third principle of permaculture got sweetened out during the years from Set limits to population and consumption to fair share Population and impact There is a relationship between amount of people and damage done, of course, but that's not all the story. The Green House Gases (GHG) emissions per capita are so different from country to country that you actually have more GHG emitted in demographically low (and rich) countries, like the USA. There doesn't seem to be a direct sure link between population decrease and decrease in GHG emission. Impact=Population*Consumption , and there is a balance between the last two that I didn't know of. A work in the decrease of population is needed , nonetheless. And no, my sarcastic friend, bombs and wars may not do it. Actually, the amount of ignorance, social insecurity and rape that wars bring with them are a proven (if not evident enough) factor in the huge demographic of third world countries, where women have little say about their willingness to have kids. Religions, cultures and traditions who don't allow for abortions of contraceptive are a great push in the wrong direction too, and that counts for all the world, so called developed or not. So go on, get your vasectomy, but if you are really sensitive about a gracefully way down educate people too. Batteries, production, increased usage... eco-solutions are not always as effective as they may look Consumption There is a way of considering consumption in terms of economy that just doesn't work for the environment. You can buy a lot of harmless stuff for high price, or spend little on very damaging things. Now, how to quantify that is a major perception problem, and is not easily solved. That is why people often prioritize an ineffective behavior, maybe because it looks more \"ecofriendly\" . This difficulty has been widely used by companies to attract sensible people, in a well known strategy called Greenwashing . This is the case of buying new, more \"ecological\" cars, while even just disposing of the old one is usually more impactful than the benefit of the new one. There are also indirect behavior consequences . Changing an habit can bring to another one, like getting an hybrid car can push people to drive farther, neutralizing the benefit. This is known as rebound effect Now, people consume a lot, but do they actually feel better ? One of the great insight of psychology is that no, they don't. Of course, financial help is not to be underestimated, especially in the environmental issues, where investments are often to be made in order to consume less in the future (buy a fabric bag for 5 euros instead of a plastic one for 5 cents). But in general, people don't feel better when they buy stuff at least in developed countries. In poorer countries, there is a more direct correlation between income and well-being, once the basic needs are satisfied the curve gets less and less steep. So, how that happens, and among who? I found interesting studies in this little book. The cultural values of hierarchy and mastery promotes more consumption, as the \"status symbols\" are expensive, and a great market niche. So, while things don't make us happy, there are evident cultural pushes to make us believe so and, in some cases, force us to do so (for example, a car or a pc is in many cases a necessity, not a luxury). Culture has a great importance here, again. Would you behave in the same way if plants had eyes? So what? So what , so we are in a deep shit, that's what. Not only we have headaches thinking of how complicated ecological matters are, but we have many behavioural and cultural obstacles in the path to solving problems. Some working notes anyhow: There is a lot of politically correctness in the matter of personal beliefs. I understand the politeness and not wanting to hurt others, but try to break taboos and have a genuine talk with others about their decisions. Don't stop at the surface. If someone brags about how they got a fairphone 'cause is more ecological, ask what was wrong with the old one. Think deeply about how much something is environmentally good. Think of how it was produced, how much resources it uses and how it's going to be disposed of. Dish-washers use less water? No, they don't, if you take in account the water used for production, for electricity and for disposal. Copyright notes The booklet cover is copyright by the American Psychological Association The picture \"Chrysler minivan, petro-hydraulic hybrid\" is By IFCAR - Own work, public domain ,"},{"title":"20 Steps design details","url":"20stepstech/","tags":"misc","text":"Intro This article wants to dive a little bit deeper in the technical design aspect of the 20 steps garden I've done, so that other designers can take inspiration and curious can have a better idea of how it was all done. You may find it boring, but whatever, is not all about shiny and funny bells in life! For the shiny and colorful bells you can read the introduction article . The plot is around 100 sqm, a very small garden, with some fruit trees already in place. Location, climate Location is in south Italy, altitude around 300m Temperatures in winter rarely get below -3°C and in summer rarely over 38°C Precipitations are around 1 meter per year, can be abundant during winter and dry for months during summer. This is something I try not to rely to, probably due to climate changing we had 9 months of drought last year, with very heavy precipitation this year. Soil and plants there already Soil was compacted, quite leaked of nutrients as rain was getting soil out of the area. pH was around neutral if somewhat basic. Trees already there included an apricot tree (15 yrs ~), a pomegranade, 2 lemon trees which bear no fruit due to shady conditions and were therefore replanted, a female kiwi which yields no fruit 'cause no male was there and a strawberry tree. They were all in good health but left unpruned for many years. Main herbaceous layer was grass blades (so called \"weeds\"). They did a wonderful job of keeping some roots in the soil and some flowers for the bees while no one was caring for it. Life in the soil was poor, in a massive digging we only found 2-3 worms. A circular paper chromatography revealed a decent mineral content but little life. Sector analysis The biggest problem here was water : even just a light rain would have spilled over the garden, leaking nutrients and soil, as in the image. The garden is facing south but doesn't really matter as most of the area was in the shade anyway, due to high buildings. You can see the shadier parts in the map. Buildings are also shielding the place from most of the wind . History The area has been neglected and abandoned for many years, only thing done has been removing all fallen leaves in autumn, actively preventing the soil from building up, so it was compacted and quite poor in terms of biodiversity. Fruit trees were planted almost randomly during the history of the house by my grandfather, who is no more. Goals So, before doing anything it's important to know what I was going to do with the garden, what did everyone wanted from it? After some talk this is what came out of it: My little brother is also living there, and I wanted a place for him to stop using the xbox and have some fun with worms. I wanted to experiment with some guilds and plants and kill time. Everybody wanted some fresh, good quality food (it was not the main goal though, experiments were a higher priority). It needed to be low maintenance and possibly good looking (beauty keeps places alive, no one is doing much efforts to mantain something ugly). The actual design Green: perennial area Yellow: annuals Brown: compost/mix White: pathway The pathway was done just with recycled pallets Walking path Here no plants are kept and it has been dug and some wood debris has been placed underneath, to allow water to i nfiltrate and create soil instead of spilling over. It has been done big enough to allow comfortable walking (hey, my grandma is 75 years old!) and for a ladder to be used, so minimum 60 cm wide. The proper social area is a bit larger. Perennial area Wouldn't call it a food forest as it is too small to actually have a forest dynamics, but that was the inspiration. Here is where most of the perennials already were, and it hasn't been worked much. The soil was digged, mixed with some aged horse manure and then heavily mulched. Guilds were set in place from the beginning. Corn, beans and pumpkins, the famous three sisters Annual - transitional part This was the most compacted and bare area. In a corner a fire used to be made at St Antony's day, as good wish. So we choose: that is the corn-er area (ahah,got it?). It was heavily dug and big trunks of wood and horse manure were buried underneath to provide a slow nutrient release, a sponge-like structure for water and an inoculation of soil microbial life (some wood was taken from a nearby forest). It is like a hugelkultur but, as we don't live in a high-precipitation area, it was not raised. Here annuals for an immediate yield were planted, first year has seen many peas, beans, corn (ancient variety from north Italy), pumpkins, ancient tomatoes, and then cauliflower broccoli and so on. Mainly annual plants, and it gave some decent harvest, but now it's slowly turning into a more perennial system . I planted an almond tree, some fennel and a male kiwi to impollinate the female. The idea is to slowly turn it into a highly productive multi-storied perennial system. Compost area I have done a small compost area at the very entrance, which is not how you usually do it. Actually, it was more hidden before, but my grandmother and people living in the house were just leaving everything at the entrance. I just made it more \"official\". Go with the flow . I usually just toss the organic stuff as mulch when I'm here, anyway. Species selection The main idea was to create few guilds around the main trees: almond, hazelnut, apricot, kiwi, strawberry tree, pomegrenade and a more herbacious area. Each new perennial has been inoculated with mychorrizal fungi when planted. The guild followed simple lines, and I put an emphasys on stuff for pollinators and local insects, so borage, marigold, cornflower and nasturtium seeds have been generously thrown here and there. Also, most of the plant had to be edible, only notable exception has been russian comfrey (Symphitum officianalis var. bocking 14), which provides biomass, helps to break the soil and it's gorgeous. I'll get maybe more into each specific guild in other articles. Structures In order to accomodate all plants planted I needed a greenhouse. Couple of pallets and some plastic roll, everything found in the trash, done. Some worm casting could have been useful for the new plants, so I set up a worm composting barrel, and those guys really are my little brother favorites. Phases of implementation The basic idea is that year 0 will have more annuals, the basic structures built and so on, year 1 will start to see some results and a gradual shift to an almost entirely perennial ecosystem, and the whole garden will reach maximum yielding at year 4, hopefully keeping it for a while. Consider that this area is too small to have a highly yielding self-sustaining system, and a continuous input from the outside, in form of kitchen scraps, paper and water is needed. Year 0 Many annuals planted, some to get some yield (corn, grains, pumpkins etc), others to start dispersing seeds around (borage, local tomatoes varieties, marigold). Some perennials were brought in, some planted, some bought. Soil was always covered, worked with generous aged manure, a porous tube irrigation system was set in place. Year 1 Yields will be less than year 0: less annuals, trees will be pruned, many small plants will start to really yield in year 2. Also, some space will still be used for soil-working plants, like radishes. Less work than year 0, just planting, mulching and harvesting basically. Under the pathway Year 2 I plan to remove the irrigation system and use it for other gardens, as the biomass should now be enough to avoid watering at all. The production will start to rise, and the maintenance getting low. There should be little need to introduce new plants now, as the useful guys will be dispersed all around, and harvesting, adding biomass and some pruning will take most of the work. Year 4 Should be at the peak. No work anymore beside harvesting and pruning (but we'll work at it anyway to try new plants, of course!), and the life should be thriving so hard that the walls will crumble down and let this wave of fertility invade the whole neighbourhood. Copyright notes Lemon color icon | designed by Vexels kiwi icon by https://icons8.com/ pomegranade icon by https://www.shareicon.net/author/alex-t apricot icon by https://icons8.com/icon/45429/apricot Wave GIMP brush: Photoshop Brushes by Brusheezy"},{"title":"20 Steps: a gentle introduction","url":"20steps/","tags":"Gardens","text":"I like gardens, so when I got back home after 2 years around the world, I felt like giving a hit to that 100 square meters behind my grandma's house. And man it was fun. The whole idea at the beginning was to experiment with guilds and produce some tomatoes, then it evolved into something more. It is now a food producing, living lab, fresh-microclimate provider, with an embedded audio by courtesy of the many birds and insects passing by. Working in the garden should be a pleasure If you stare at a point in the garden long enough, you start to see lizards, bugs, spiders, all of it while eating strawberries from the plant. How cool is that , if you just forget about the mosquitoes which I didn't manage to get rid of just yet. But it wasn't always like this. I mean, mosquito-wise yes, but before the place was poor with life, quite simple (read: fragile and boring), and less colorful. Don't want to bore you with the details, but I'll put some design notes in this article . Now I just want to share some happiness for reaching version 0.1 of this garden, called 20 steps because well, that's all it takes you to get from one end of it to another. The road to it.. .. was quite smooth, with the occasional bump. Working the soil is not that fun by hand. One of the reasons I like regenerative ecosystems is that you usually invest a lot of work upfront but then kick back and do a light maintenance. Why do more than that. There was a lot of digging, a lot of resources patiently collected in a month or so (I was working as a personal driver at the time, so had many chances of peeking in many trashes!), and some social tension when I told my grandmother to put the kitchen scraps in the garden. A shit , I tell you, that was the best part. A ton of horseshit, I love playing with that stuff. Anyway, the game was finding those otherwise boring works enjoyable, so we called for a few friends here to work and then eat all together, made it a game with my 9 yo brother, and I entered a friendly competition with my neighbor who also started his veggie garden at about the same time. He produced more that year, if we ignore the fruit tree production, but his soil now sucks, while mine is a brown gold. If you ask him, of course, he produced more and my garden is a mess, so I'd say each one won its own way. Snow is a decent mulch too .. and then the results I was quite satisfied with the results. The soil is way better now , there is an automated irrigation system, and even though production is not at the peak yet (should get there next year), I already harvested pumpkins, corn, many cabbages, nettle, tomatoes, onions, chilly, and herbs like parsley, sage, basil, rosemary and more. Not bad, for a place that also gave me some great insights. Other yields are a ton of cuttings, seeds and plants that I used to guerrilla garden in the area, so I can boost production using abandoned public places for next years. Some nice experiments include a capillarity string watering (yeah, didn't work well), worm towers in the ground (worked pretty well), and trying to adapt some species to more shady conditions. Beside, it has many flowers like borage, watercress (it doesn't need that much water, what do you know), marigold and calendula, all edible, and many insects which I don't know if are edible, haven't tried yet frankly. One of the best results is that some friend got excited by it and I've helped doing their place too, hoping to push further this geometric expansion of regenerative self production of food- No mistakes? Yeah well, I've done some disturbingly silly things in here. A proper organic mulch looks so great! From the pictures you may see how shady everything is : and I've pruned already this year! I decided to plant an hazelnut in the deep shade, shading everything even more. Yes I did. I had big plans of getting it to go towards the roof and all, but I'm now waiting for the autumn to remove it and use it to guerrilla garden. I often lose what I plant . I don't know how that happens. I lost the cucumber plants at one point last year, only to find a ripe cucumber a few months later. The other cucumbers just disappeared. I underplanted the groundcover layer . I focused a lot on mulching to build the soil in the first year, but now there are too many spots without plants, and that is not helping. That is also because I plant small saplings, than I forget about them and just cover them in my psychotic relationship with mulch. All in all, it could have been worst =) Cool, isn't it? This was a rather small area. If you have some place, consider that working it doesn't need to be a stress, but a pleasure and a trip of wonder in the field of natural sciences, and a puzzle game in how to fit all you can together and optimize the whole system for your yields. Some Before-After Before After Before After Before After"},{"title":"Dynamic accumulators","url":"dynamicaccumulators/","tags":"misc","text":"I believed in dynamic accumulators for a while, religiously repeating what I read in many books. But after a client sincerely asked me to provide him some sources for how they are supposed to work, I found myself with a silent pubmed , an internet stacked of gardening/permaculture websites that just referred to each other as source, and the uncomfortable but refreshing feeling of haven't done my homework properly before opening my mouth. Best article I found was this one , by John Kitsteiner (I highly recommend him and his website, temperate climate permaculture ). Seems like he followed a similar path: searched, nothing found. He sent a few emails to \"big names\" such as Toby Hemenway and Dave Jacke, and they both admitted that they didn't have any research to substantiate the very concept of dynamic accumulator. The wikipedia page was not exempt from this dynamic accumulators hype, so I had to rewrite the page, basically down up. So I'm now celebrating another nice page. Yahoo! Borage and Comfrey are beautiful and useful plants, even without any myth around them."},{"title":"Introduction to Regen Network","url":"RegenNetwork/","tags":"misc","text":"One of the main causes of the environmental degradation right now is that not caring about its effect on the environment is a winning model for a company, especially in the agricultural field. There is a continous positive feedback, easy bureaucracy, less costs, subsidies from the state and more. Someone who wants to go for a regenerative approach, on the other hand, has to face many negative feedbacks: has to work extra hard for less money, doesn't usually get subsidies, quite the opposite and actually has to go against the law, and needs a lot of knowledge, just to start. I'm quite sure that pushing the feedbacks in the right direction is of paramount importance if we want to get the ecosystem on its feet. What does Regen Network do Money is usually backed by something. Often by gold, sometimes money was gold, other times by petrol, or GDP. In general, though, you don't see money backed and connected to the real source of value: natural resources, water, fertility, air, life. The abstraction layers are so and such that it may be difficult to see that that is the start of all other values. Regen Network (RN) is trying to give that environmental value an economic counterpart, and to incentivize positive economical feedbacks to rigenerative companies by using a decentralized model. It was created by some well known names in the permaculture world, like Christian Shearer and Gregory Landua. Right now is still gathering funds, so it hasn't started yet. So, ignoring the technical details, this is what RN is aiming to do: be a verified database of the data collected in the places that joined the network. It will allow to verify in a transparent manner that the soil and the environemnt there is really getting better (or worst). The data is obtained using various protocols, involving on-site sensors, satellite data, third party verifications and more. Put in contact entities with interest in financiate rigenerative projects (institutions, privates, no-profit...) and the projects themselves, using a smart contract model. Develop the general health of the RN by working on protocols, helping the community and kick-starting regenerative projects. How does it do it ''Blockchain''. Regen network will have as a decentralized database a blockchain (based on tindermint engine), which will be processed and validated by many independent nodes, garanteeing the metadata of the informations (time, place and so on), and that the informations are true, because all the nodes will have a copy of those informations (or of the hashing of the off-chain informations, but I don't want to get into technicalities) ''Environmental State Protocols (ESP)'', practically algorithms that allow to get useful informations from the data and to quantify the effects on the environment. For example, a protocol may consider the quantity of green as seen from a satellite and the values of on-site sensors for albedo and pressure to indicate that there actually is a cover crop on that field, and how much. The implications of being able to really see what's going on on a land and to authomatically elaborate the data, without getting corruptible third parties in the middle, is one of the main strength of the project ''Smart Contracts'', called ''Ecological Conctracts'' in RN. Those are automated contracts that, starting from the informations gathered with protocols, allow to unlock the funds from a donor to who reaches the goals. It may sound complex, but let's see some simple example Examples Italy realizes that reaching the goal of the Paris Agreement is harder than it thought. So, it puts money away to financiate everyone who can prove to sequester carbon from the atmosphere by using a set of protocols, putting subsidies for, like, 200 € per hectar if the soil gets over a certain degree of carbon sequestered. The process is immediate as it uses a smart contract, in the moment that the improvement is registered by the blockchain the payment starts in an authomatic way and the funds are released (euros, bitcoins, XRN or whatever) Mario doesn't wont to pay those shady guys from the Bio certifications, but doesn't know how to garanteee to his customers that he is really producing food stuff while making the environment better. Using a series of protocols he shows everyone the data from his place, and the consumers can see by themselves how his work is impacting the soil. This is better than a certification, and gives him quite some advertisment. Raphael has a big land and gathers a lot of data, beside everything else, he decides to keep his data available only on purchase, as the data is his and he can do whatever he wants with it. Many big data and research companies need good quality data, and Mario gets an extra income by providing data A comnsumer can easily look around him for farmers that work in a way that is improving the environment, and go for them as his choice Now, let's get this straight, I don't think that carbon in the atmosphere is \"the\" problem. Sequester carbon into the soil should be a welcomed side effect of activities that aim for an ecological restoration, not a scope in itself. I am not a meteorologist, but from what I've studied carbon is not anyway the only thing that matter in the planet temperature rising, the high altitude humidity for example may be accountable for a more pronunciated effect. But you know, carbon is on everyone's mounth lately, and is anyway a good indicator of the work done, we should probably keep it as that. Conclusions I still have quite some doubts about this project. The idea is nice, and I am sure it may have many use cases that I have not foreseen, but I'll wait for the webinair in two days to get a more solid idea. Meanwhile, do your homework: website whitepaper architecture protocols riot room telegram Copyright notes The image in the header and the one in the article are copyrighted by Regen Network, taken from their website with permission to use given in chat"},{"title":"First step","url":"firstpost/","tags":"misc","text":"In my life I created quite a few website, either for job or pleasure, but in all honesty I had some trouble in writing my first post here. I anyhow decided to ignore the tips from the big \"content marketing\" experts (no, no clickbaits titles and boobs as images) and I am instead going direct to the point of why I'm here. When I was a teen-ager, after all, trying to pick up ladies following the gurus' techniques has rarely proven to be more than an embarassment to myself. Why The noise/information ratio on the internet is already catastrophically high, and that's a reason why I don't have any social network account, but I still feel like I have something to say , and writing is quite a therapeutic act for me. I don't monetize the traffic, there are no ads here, I don't try to seduce the passerby. Beside that, I really need a place where to show my works, otherwise I could never propose myself as a designer, photographer or whatever. Contents will therefore be oriented towards environmental problems, like sweet water depletion, desertification, biodiversity loss, but I won't mind in touching less obviously related subjects such as intellectual property, linguistic, technology and more. I'll also try to document my projects, but I'm not in the business of reinventing the wheel . I will not write stuff you can already find elsewhere, and also for important informations, I may write them on wikipedia instead and come here just to celebrate. Who am I Frankly, I'm just a dude. I have a bachelor degree in herbalism, a permaculture designer certificate (yeah, the infamous PDC), I worked in farms and as IT, traveled and helped environmental projects for years. What does that mean, in all fairness? Not as much as it may seem. The only true important knowledge that I feel like I've accumulated in the years is the limits of my/our understanding of the world, how ignorant are we in front of the unexpectedness of nature and its complex, opaque causal relationships. Sometimes that ignites a bright wonder, other times my ignorance is quite of a downer. I don't pretend to know that much on any subject, and if I take some slips I am happy to be corrected, please let me know in a mail. Or just write me to tell me how handsome I am, and send me some money, why not :) This website From a technical point of view, this website is proudly done with pelican , a python-based static website generator, with pelican-bootstrap3 as theme, and is hosted by github pages. In another article I may go more indeep about the design choices for this website. Now, I broke the ice, hope we'll get along during my little adventure with this space"},{"title":"Accumulatori dinamici","url":"it/dynamicaccumulators/","tags":"misc","text":"Ho creduto a lungo negli accumulatori dinamici, ripetendo religiosamente il contenuto di molti libri. Ma quando un cliente mi ha chiesto in tutta onestà di mandargli delle ricerche al riguardo mi sono trovato di fronte un pubmed silenzioso, un internet pieno di siti di giardinaggio e permacultura che fondamentalmente si citavano a vicenda, e la sensazione scomoda ma rinfrescante di non aver fatto i compiti a casa prima di parlare. Il migliore articolo che ho trovato è stato questo , di John Kitsteiner (consiglio caldamente il suo sito, temperate climate permaculture ). Sembra aver seguito una strada simile alla mia: ha cercato, non ha trovato nulla. Ha mandato qualche email a \"grandi nomi\" come Toby Hemenway e Dave Jake, e hanno entrambi ammesso di non avere alcuno studio che supportasse l'idea di accumulatore dinamico. La pagina di wikipedia era ovviamente coinvolta in questo complotto, ed era un dovere morale riscriverla. Quindi festeggio un'altra buona pagina su wikipedia. Yahoo! La borraggine e la consolida sono bellissime e utilissime, anche senza favole attorno."},{"title":"Introduzione al Regen Network","url":"it/RegenNetwork/","tags":"misc","text":"Una delle principali cause del degrado ambientale attuale è che per un'impresa non curarsi dei propri effetti sulla biosfera è un modello vincente, soprattutto nell'agricoltura. C'è un feedback positivo continuo, con vendite maggiori, cose più facili, con sussidi statali talvolta poco sensati, con spese inferiori, mentre un approccio rigenerativo all'agricoltura, per quanto possa essere utile nel grande ordine delle cose, incontra spesso molti feedback negativi: molto lavoro, entrate più basse, difficoltà burocratiche, e bisogno di un'enorme iniezione di conoscenze per iniziare. Sono convinto, ma ne parlerò più dettagliamente in futuro, che spingere i feedback nella giusta direzione sia fondamentale per risolvere qualcosa. Cosa fa Regen Network Il denaro è solitamente collegato a qualcosa. Spesso è stato considerato un equivalente dell'oro, a volte era l'oro stesso, altre volte è collegato al petrolio o al PIL. In generale, però, non si vede mai il denaro collegato alla vera fonte di valore: le risorse naturali, acqua, fertilità, aria, vita. I livelli di astrazione sono tanti e tali da rendere difficile vedere che è quella la fonte iniziale di ogni altro valore. Regen Network è un tentativo di dare a quel valore ambientale una controparte economica e promuovere feedback economici alle attività rigeneratrici utilizzando un modello decentralizzato. È creato da alcuni nomi piuttosto noti negli ambienti permaculturali e di agricoltura rigenerativa, come Christian Shearer e Gregory Landua. Attualmente è ancora in una fase di raccolta fondi, e il progetto non è ancora partito. Alla fine della fiera, se vogliamo ignorare tutti i dettagli tecnici, fa fondamentalmente tre cose: Fa da verificatore e database decentralizzato delle informazioni ottenute nei luoghi che aderiscono al progetto. In pratica permette di verificare in maniera trasparente che in un luogo il suolo stia davvero migliorando, o che davvero stia aumentando l'infiltrazione di acqua nel suolo. I dati vengono ottenuti tramite vari protocolli che includono sensori, dati satellitari, report di terze parti o in prima persona. Fa da tramite tra enti che vogliono finanziare i progetti rigenerativi (istituzioni, privati, no-profit, quel che sia) e i progetti stessi, utilizzando un modello di smart contract. Sviluppa in generale la salute del progetto incentivando la produzione di protocolli, le comunità, i singoli progetti agricoli e l'adozione. Come lo fa Blockchain .Regen network avrà come database decentralizzato una blockchain, validata e processata da più nodi indipendenti, garantendo i metadati delle informazioni (orario, luogo ecc.) e che le informazion in sé siano veritiere, perché tutti i nodi avranno una copia delle informazioni (o degli hashing delle informazioni conservati off-chain, ma non voglio entrare in tecnicismi) Environmental State Protocols (ESP) : in pratica dei semplici algoritmi che permettono, dai dati ottenuti, di ricavare delle informazioni utili e quantificare le effettive migliorie nell'ambiente. Ad esempio, un protocollo potrebbe considerare la quantità di verde vista da satellite e i valori di sensori per pressione umidità ed albedo per indicare che in un luogo ci sia effettivamente un cover crop o meno, e quanto. Il valore di poter sapere cosa accade davvero in un terreno e poter elaborare automaticamente i dati, senza mettere in mezzo terze parti e complessi controlli suscettibili di corruzione, è il punto di forza maggiore del progetto. Smart Contracts , chiamati in RN Ecological Contracts. Questi sono i contratti automatizzati che, partendo dalle informazioni date dai protocolli, permettono di sbloccare l'accesso a dei fondi da parte di chi raggiunge gli obiettivi. Può sembrare complesso, ma vediamo qualche esempio terra terra. Esempi L'Italia si rende conto che raggiungere gli obiettivi del concordato di Parigi è più arduo di quanto previsto. Stanzia quindi dei finanziamenti per chiunque dia prova di sequestrare carbonio tramite un set di protocolli, mettendo sovvenzioni chessò, a 200 euro ad ettaro per chi raggiunga una certa soglia di miglioramento. Il processo è istantaneo attraverso uno smart contract, nel momento in cui viene verificato il miglioramento in maniera automatica vengono sbloccati i fondi sotto forma di euro, bitcoin, regen network token, o altro Mario non vuole pagare la mafia del marchio Bio, ma non sa come garantire ai suoi consumatori che davvero produce robba buona e migliora l'ambiente. Utilizzando una serie di protocolli mette a disposizione di tutti i rilevamenti del suo terreno, e i consumatori possono vedere da soli che le cose migliorano, vedere le immagini satellitari e valutare il lavoro di Mario, che si fa pure un po' di pubblicità. Raffaele ha un terreno e raccoglie molti dati. Decide di rendere disponibili i dati sotto pagamento, o abbonamento. Sono i suoi e ci fa quello che vuole, e molte compagnie di ricerca pagano per avere dati di buona qualità. Un'ulteriore fonte di entrata per Raffaele. Un consumatore può facilmente cercare vicino a lui imprese che lavorano in maniera positiva per l'ambiente, e scegliere quelle anche perché il cibo è facilmente più buono Ora, intendiamoci, io non credo che il carbonio nell'atmosfera sia il problema. Sequestrare carbonio nel suolo dovrebbe essere un gradito effetto collaterale di attività che puntano a ripristinare falde acquifere, purificare il terreno, rivitalizzarlo, ridare habitat a specie a rischio, chiudere i cicli di acqua e materiale organico in loco, non un obiettivo in sé. Non sono un meteorologo, ma gli studi letti mi hanno portato a pensare che il metano e l'umidità ad alta quota siano ad esempio più gravi del carbonio nell'atmosfera per l'effetto serra. Il carbonio però è una parola che fa tanto parlare di sé ultimamente, ed è comunque un indicatore utile per i lavori svolti, teniamocelo buono. So per certo che questa è anche l'opinione del Regen Network. Conclusioni Ho ancora qualche dubbio su questo progetto. L'idea è buona, e sono sicuro che tante altre applicazioni possono derivare a cui ancora non ho pensato, ma attenderò il webinar che ci sarà tra due giorni per trarne un'idea più solida. Intanto, fate pure un po' di compitini a casa: sito internet whitepaper architettura protocolli stanza riot telegram Note sul copyright L'immagine di testata e nell'articolo sono copyright di Regen Network"},{"title":"Primo passetto","url":"it/firstpost/","tags":"misc","text":"Ho creato un po' di siti internet nella mia vita, per lavoro e per piacere, ma mi sono onestamente trovato un po' in difficoltà nello scrivere il mio primo post qui. Ho deciso comunque di ignorare i consigli dei grandi esperti di \"content marketing\" (no, non ci sono titoli d'effetto o tette come immagine) e andare al sodo di perché sono qui. D'altronde, ricordo che anche in gioventù cercare di fare acchiappanza con le tecniche dei grandi guru si è rivelata una tecnica sempre più imbarazzante che altro. Perché Il rapporto rumore/informazione su internet è catastroficamente alto, ed è un motivo per cui non ho account sui social network, ma ciò non toglie che credo di avere qualcosa da dire , e trovo scrivere un atto terapeutico e di sviluppo. Non monetizzo il traffico, non ci sono pubblicità, non cerco di sedurre i malcapitati lettori occasionali. Oltre ciò, ho davvero bisogno di una bacheca dove mostrare agli altri i miei lavori, cosa indispensabile per proporsi come designer, fotografo o quel che sia. I contenuti saranno quindi orientati verso problemi con uno spiccato impatto ambientale come la deplezione delle risorse idriche, la desertificazione, la perdita di biodiversità, ma non credo mi farò problemi a toccare questioni più trasversali come la proprietà intellettuale, la linguistica, il creazionismo e qualche recensione di libro. Cercherò anche di documentare le mie azioni, ma non sono nel business di reinventare la ruota. Se una informazione è già online, meglio non ingolfare l'etere di ridondanza, a meno che non si tratti di una personale elaborazione, e le cose utili preferisco scriverle su wikipedia o wikibooks e magari mettere un articolo qui per celebrare. Chi sono io? In tutta franchezza, solo un tizio di passaggio. Ho una laurea in erboristeria e un certificato di permacultore (proprio lui, l'infame PDC), ho viaggiato, lavorato in fattorie e collaborato con progetti ambientalisti per anni, e cosa significa tutto ciò? Molto meno di quanto si potrebbe pensare, e l'unica vera, importante conoscenza che sento di aver accumulato nel tempo è quella dei limiti del nostro sapere, di quanto siamo ignoranti rispetto all'imprevedibilità della natura e ai suoi tortuosi e opachi rapporti causali. Talvolta la cosa mi riempie di un luminoso stupore, altre volte di un cupo abbattimento di fronte alla mia ignoranza. In realtà non credo di essere un genio in nessun campo, e se scrivo scemenze sono felice di essere corretto con una mail. Certo, potete anche solo scrivermi per dirmi quanto sono bello, o per offrirmi dei soldi (noi avventurieri stiamo spesso un po' a corto) :) Questo sito Da un punto di vista tecnico: questo sito è orgogliosamente realizzato con pelican , un generatore di siti statici in python, e utilizzo il tema pelican-bootstrap3 . In un altro articolo andrò più nel dettaglio sul lavoro dietro le quinte e le scelte di design del sito. Ora ho rotto il ghiaccio, spero andremo d'accordo in questa avventura che mi sono concesso con questo spazietto online."}]}