{"pages":[{"tags":"pages","url":"avventure/","text":"","title":"Avventure"},{"tags":"pages","url":"feeds/","text":"Feed in Inglese Feed in Italiano","title":"feeds"},{"tags":"pages","url":"index/","text":"Mi chiamo Manu e sono un avventuriero . La mia ricerca principale gravita attorno a questioni ecologiche e ambientali, e questo sito è un diario di pensieri, analisi e invettive, e dove documento i miei tentativi di risolvere qualcosa come permacultore, giardiniere, erborista, IT ed essere umano. Perfino tra le pagine dei diari più tecnici è bello vedere fiori a seccare, disegni e appunti a margine qua e là, quindi ogni tanto potrebbe scappare qualche articolo fotografico, di videomaking o altro. L'avventura è anche ispirazione, gioco e divertimento, dopo tutto. Grazie per passare di qui. Davvero.","title":"index"},{"tags":"pages","url":"trofei/","text":"Autoconferiti","title":"Trofei"},{"tags":"misc","url":"dynamicaccumulators/","text":"Ho creduto a lungo negli accumulatori dinamici, ripetendo religiosamente il contenuto di molti libri. Ma quando un cliente mi ha chiesto in tutta onestà di mandargli delle ricerche al riguardo mi sono trovato di fronte un pubmed silenzioso, un internet pieno di siti di giardinaggio e permacultura che fondamentalmente si citavano a vicenda, e la sensazione scomoda ma rinfrescante di non aver fatto i compiti a casa prima di parlare. Il migliore articolo che ho trovato è stato questo , di John Kitsteiner (consiglio caldamente il suo sito, temperate climate permaculture ). Sembra aver seguito una strada simile alla mia: ha cercato, non ha trovato nulla. Ha mandato qualche email a \"grandi nomi\" come Toby Hemenway e Dave Jake, e hanno entrambi ammesso di non avere alcuno studio che supportasse l'idea di accumulatore dinamico. La pagina di wikipedia era ovviamente coinvolta in questo complotto, ed era un dovere morale riscriverla. Quindi festeggio un'altra buona pagina su wikipedia. Yahoo! La borraggine e la consolida sono bellissime e utilissime, anche senza favole attorno.","title":"Accumulatori dinamici"},{"tags":"misc","url":"RegenNetwork/","text":"Una delle principali cause del degrado ambientale attuale è che per un'impresa non curarsi dei propri effetti sulla biosfera è un modello vincente, soprattutto nell'agricoltura. C'è un feedback positivo continuo, con vendite maggiori, cose più facili, con sussidi statali talvolta poco sensati, con spese inferiori, mentre un approccio rigenerativo all'agricoltura, per quanto possa essere utile nel grande ordine delle cose, incontra spesso molti feedback negativi: molto lavoro, entrate più basse, difficoltà burocratiche, e bisogno di un'enorme iniezione di conoscenze per iniziare. Sono convinto, ma ne parlerò più dettagliamente in futuro, che spingere i feedback nella giusta direzione sia fondamentale per risolvere qualcosa. Cosa fa Regen Network Il denaro è solitamente collegato a qualcosa. Spesso è stato considerato un equivalente dell'oro, a volte era l'oro stesso, altre volte è collegato al petrolio o al PIL. In generale, però, non si vede mai il denaro collegato alla vera fonte di valore: le risorse naturali, acqua, fertilità, aria, vita. I livelli di astrazione sono tanti e tali da rendere difficile vedere che è quella la fonte iniziale di ogni altro valore. Regen Network è un tentativo di dare a quel valore ambientale una controparte economica e promuovere feedback economici alle attività rigeneratrici utilizzando un modello decentralizzato. È creato da alcuni nomi piuttosto noti negli ambienti permaculturali e di agricoltura rigenerativa, come Christian Shearer e Gregory Landua. Attualmente è ancora in una fase di raccolta fondi, e il progetto non è ancora partito. Alla fine della fiera, se vogliamo ignorare tutti i dettagli tecnici, fa fondamentalmente tre cose: Fa da verificatore e database decentralizzato delle informazioni ottenute nei luoghi che aderiscono al progetto. In pratica permette di verificare in maniera trasparente che in un luogo il suolo stia davvero migliorando, o che davvero stia aumentando l'infiltrazione di acqua nel suolo. I dati vengono ottenuti tramite vari protocolli che includono sensori, dati satellitari, report di terze parti o in prima persona. Fa da tramite tra enti che vogliono finanziare i progetti rigenerativi (istituzioni, privati, no-profit, quel che sia) e i progetti stessi, utilizzando un modello di smart contract. Sviluppa in generale la salute del progetto incentivando la produzione di protocolli, le comunità, i singoli progetti agricoli e l'adozione. Come lo fa Blockchain .Regen network avrà come database decentralizzato una blockchain, validata e processata da più nodi indipendenti, garantendo i metadati delle informazioni (orario, luogo ecc.) e che le informazion in sé siano veritiere, perché tutti i nodi avranno una copia delle informazioni (o degli hashing delle informazioni conservati off-chain, ma non voglio entrare in tecnicismi) Environmental State Protocols (ESP) : in pratica dei semplici algoritmi che permettono, dai dati ottenuti, di ricavare delle informazioni utili e quantificare le effettive migliorie nell'ambiente. Ad esempio, un protocollo potrebbe considerare la quantità di verde vista da satellite e i valori di sensori per pressione umidità ed albedo per indicare che in un luogo ci sia effettivamente un cover crop o meno, e quanto. Il valore di poter sapere cosa accade davvero in un terreno e poter elaborare automaticamente i dati, senza mettere in mezzo terze parti e complessi controlli suscettibili di corruzione, è il punto di forza maggiore del progetto. Smart Contracts , chiamati in RN Ecological Contracts. Questi sono i contratti automatizzati che, partendo dalle informazioni date dai protocolli, permettono di sbloccare l'accesso a dei fondi da parte di chi raggiunge gli obiettivi. Può sembrare complesso, ma vediamo qualche esempio terra terra. Esempi L'Italia si rende conto che raggiungere gli obiettivi del concordato di Parigi è più arduo di quanto previsto. Stanzia quindi dei finanziamenti per chiunque dia prova di sequestrare carbonio tramite un set di protocolli, mettendo sovvenzioni chessò, a 200 euro ad ettaro per chi raggiunga una certa soglia di miglioramento. Il processo è istantaneo attraverso uno smart contract, nel momento in cui viene verificato il miglioramento in maniera automatica vengono sbloccati i fondi sotto forma di euro, bitcoin, regen network token, o altro Mario non vuole pagare la mafia del marchio Bio, ma non sa come garantire ai suoi consumatori che davvero produce robba buona e migliora l'ambiente. Utilizzando una serie di protocolli mette a disposizione di tutti i rilevamenti del suo terreno, e i consumatori possono vedere da soli che le cose migliorano, vedere le immagini satellitari e valutare il lavoro di Mario, che si fa pure un po' di pubblicità. Raffaele ha un terreno e raccoglie molti dati. Decide di rendere disponibili i dati sotto pagamento, o abbonamento. Sono i suoi e ci fa quello che vuole, e molte compagnie di ricerca pagano per avere dati di buona qualità. Un'ulteriore fonte di entrata per Raffaele. Un consumatore può facilmente cercare vicino a lui imprese che lavorano in maniera positiva per l'ambiente, e scegliere quelle anche perché il cibo è facilmente più buono Ora, intendiamoci, io non credo che il carbonio nell'atmosfera sia il problema. Sequestrare carbonio nel suolo dovrebbe essere un gradito effetto collaterale di attività che puntano a ripristinare falde acquifere, purificare il terreno, rivitalizzarlo, ridare habitat a specie a rischio, chiudere i cicli di acqua e materiale organico in loco, non un obiettivo in sé. Non sono un meteorologo, ma gli studi letti mi hanno portato a pensare che il metano e l'umidità ad alta quota siano ad esempio più gravi del carbonio nell'atmosfera per l'effetto serra. Il carbonio però è una parola che fa tanto parlare di sé ultimamente, ed è comunque un indicatore utile per i lavori svolti, teniamocelo buono. So per certo che questa è anche l'opinione del Regen Network. Conclusioni Ho ancora qualche dubbio su questo progetto. L'idea è buona, e sono sicuro che tante altre applicazioni possono derivare a cui ancora non ho pensato, ma attenderò il webinar che ci sarà tra due giorni per trarne un'idea più solida. Intanto, fate pure un po' di compitini a casa: sito internet whitepaper architettura protocolli stanza riot telegram Note sul copyright L'immagine di testata e nell'articolo sono copyright di Regen Network","title":"Introduzione al Regen Network"},{"tags":"misc","url":"firstpost/","text":"Ho creato un po' di siti internet nella mia vita, per lavoro e per piacere, ma mi sono onestamente trovato un po' in difficoltà nello scrivere il mio primo post qui. Ho deciso comunque di ignorare i consigli dei grandi esperti di \"content marketing\" (no, non ci sono titoli d'effetto o tette come immagine) e andare al sodo di perché sono qui. D'altronde, ricordo che anche in gioventù cercare di fare acchiappanza con le tecniche dei grandi guru si è rivelata una tecnica sempre più imbarazzante che altro. Perché Il rapporto rumore/informazione su internet è catastroficamente alto, ed è un motivo per cui non ho account sui social network, ma ciò non toglie che credo di avere qualcosa da dire , e trovo scrivere un atto terapeutico e di sviluppo. Non monetizzo il traffico, non ci sono pubblicità, non cerco di sedurre i malcapitati lettori occasionali. Oltre ciò, ho davvero bisogno di una bacheca dove mostrare agli altri i miei lavori, cosa indispensabile per proporsi come designer, fotografo o quel che sia. I contenuti saranno quindi orientati verso problemi con uno spiccato impatto ambientale come la deplezione delle risorse idriche, la desertificazione, la perdita di biodiversità, ma non credo mi farò problemi a toccare questioni più trasversali come la proprietà intellettuale, la linguistica, il creazionismo e qualche recensione di libro. Cercherò anche di documentare le mie azioni, ma non sono nel business di reinventare la ruota. Se una informazione è già online, meglio non ingolfare l'etere di ridondanza, a meno che non si tratti di una personale elaborazione, e le cose utili preferisco scriverle su wikipedia o wikibooks e magari mettere un articolo qui per celebrare. Chi sono io? In tutta franchezza, solo un tizio di passaggio. Ho una laurea in erboristeria e un certificato di permacultore (proprio lui, l'infame PDC), ho viaggiato, lavorato in fattorie e collaborato con progetti ambientalisti per anni, e cosa significa tutto ciò? Molto meno di quanto si potrebbe pensare, e l'unica vera, importante conoscenza che sento di aver accumulato nel tempo è quella dei limiti del nostro sapere, di quanto siamo ignoranti rispetto all'imprevedibilità della natura e ai suoi tortuosi e opachi rapporti causali. Talvolta la cosa mi riempie di un luminoso stupore, altre volte di un cupo abbattimento di fronte alla mia ignoranza. In realtà non credo di essere un genio in nessun campo, e se scrivo scemenze sono felice di essere corretto con una mail. Certo, potete anche solo scrivermi per dirmi quanto sono bello, o per offrirmi dei soldi (noi avventurieri stiamo spesso un po' a corto) :) Questo sito Da un punto di vista tecnico: questo sito è orgogliosamente realizzato con pelican , un generatore di siti statici in python, e utilizzo il tema pelican-bootstrap3 . In un altro articolo andrò più nel dettaglio sul lavoro dietro le quinte e le scelte di design del sito. Ora ho rotto il ghiaccio, spero andremo d'accordo in questa avventura che mi sono concesso con questo spazietto online.","title":"Primo passetto"},{"tags":"misc","url":"../dynamicaccumulators/","text":"I believed in dynamic accumulators for a while, religiously repeating what I read in many books. But after a client sincerely asked me to provide him some sources for how they are supposed to work, I found myself with a silent pubmed, an internet stacked of gardening/permaculture websites that just referred to each other as source, and the uncomfortable but refreshing feeling of haven't done my homework properly before opening my mouth. Best article I found was this one , by John Kitsteiner (I highly recommend him and his website, temperate climate permaculture ). Seems like he followed a similar path: searched, nothing found. He sent a few emails to \"big names\" such as Toby Hemenway and Dave Jacke, and they both admitted that they didn't have any research to substantiate the very concept of dynamic accumulator. The wikipedia page was not exempt from this dynamic accumulators hype, so I had to rewrite the page, basically down up. So I'm now celebrating another nice page. Yahoo! Borage and Comfrey are beautiful and useful plants, even without any myth around them.","title":"Dynamic accumulators"},{"tags":"misc","url":"../RegenNetwork/","text":"One of the main causes of the environmental degradation right now is that not caring about its effect on the environment is a winning model for a company, especially in the agricultural field. There is a continous positive feedback, easy bureaucracy, less costs, subsidies from the state and more. Someone who wants to go for a regenerative approach, on the other hand, has to face many negative feedbacks: has to work extra hard for less money, doesn't usually get subsidies, quite the opposite and actually has to go against the law, and needs a lot of knowledge, just to start. I'm quite sure that pushing the feedbacks in the right direction is of paramount importance if we want to get the ecosystem on its feet. What does Regen Network do Money is usually backed by something. Often by gold, sometimes money was gold, other times by petrol, or GDP. In general, though, you don't see money backed and connected to the real source of value: natural resources, water, fertility, air, life. The abstraction layers are so and such that it may be difficult to see that that is the start of all other values. Regen Network (RN) is trying to give that environmental value an economic counterpart, and to incentivize positive economical feedbacks to rigenerative companies by using a decentralized model. It was created by some well known names in the permaculture world, like Christian Shearer and Gregory Landua. Right now is still gathering funds, so it hasn't started yet. So, ignoring the technical details, this is what RN is aiming to do: be a verified database of the data collected in the places that joined the network. It will allow to verify in a transparent manner that the soil and the environemnt there is really getting better (or worst). The data is obtained using various protocols, involving on-site sensors, satellite data, third party verifications and more. Put in contact entities with interest in financiate rigenerative projects (institutions, privates, no-profit...) and the projects themselves, using a smart contract model. Develop the general health of the RN by working on protocols, helping the community and kick-starting regenerative projects. How does it do it ''Blockchain''. Regen network will have as a decentralized database a blockchain (based on tindermint engine), which will be processed and validated by many independent nodes, garanteeing the metadata of the informations (time, place and so on), and that the informations are true, because all the nodes will have a copy of those informations (or of the hashing of the off-chain informations, but I don't want to get into technicalities) ''Environmental State Protocols (ESP)'', practically algorithms that allow to get useful informations from the data and to quantify the effects on the environment. For example, a protocol may consider the quantity of green as seen from a satellite and the values of on-site sensors for albedo and pressure to indicate that there actually is a cover crop on that field, and how much. The implications of being able to really see what's going on on a land and to authomatically elaborate the data, without getting corruptible third parties in the middle, is one of the main strength of the project ''Smart Contracts'', called ''Ecological Conctracts'' in RN. Those are automated contracts that, starting from the informations gathered with protocols, allow to unlock the funds from a donor to who reaches the goals. It may sound complex, but let's see some simple example Examples Italy realizes that reaching the goal of the Paris Agreement is harder than it thought. So, it puts money away to financiate everyone who can prove to sequester carbon from the atmosphere by using a set of protocols, putting subsidies for, like, 200 € per hectar if the soil gets over a certain degree of carbon sequestered. The process is immediate as it uses a smart contract, in the moment that the improvement is registered by the blockchain the payment starts in an authomatic way and the funds are released (euros, bitcoins, XRN or whatever) Mario doesn't wont to pay those shady guys from the Bio certifications, but doesn't know how to garanteee to his customers that he is really producing food stuff while making the environment better. Using a series of protocols he shows everyone the data from his place, and the consumers can see by themselves how his work is impacting the soil. This is better than a certification, and gives him quite some advertisment. Raphael has a big land and gathers a lot of data, beside everything else, he decides to keep his data available only on purchase, as the data is his and he can do whatever he wants with it. Many big data and research companies need good quality data, and Mario gets an extra income by providing data A comnsumer can easily look around him for farmers that work in a way that is improving the environment, and go for them as his choice Now, let's get this straight, I don't think that carbon in the atmosphere is \"the\" problem. Sequester carbon into the soil should be a welcomed side effect of activities that aim for an ecological restoration, not a scope in itself. I am not a meteorologist, but from what I've studied carbon is not anyway the only thing that matter in the planet temperature rising, the high altitude humidity for example may be accountable for a more pronunciated effect. But you know, carbon is on everyone's mounth lately, and is anyway a good indicator of the work done, we should probably keep it as that. Conclusions I still have quite some doubts about this project. The idea is nice, and I am sure it may have many use cases that I have not foreseen, but I'll wait for the webinair in two days to get a more solid idea. Meanwhile, do your homework: website whitepaper architecture protocols riot room telegram Copyright notes The image in the header and the one in the article are copyrighted by Regen Network, taken from their website with permission to use given in chat","title":"Introduction to Regen Network"},{"tags":"misc","url":"../firstpost/","text":"In my life I created quite a few website, either for job or pleasure, but in all honesty I had some trouble in writing my first post here. I anyhow decided to ignore the tips from the big \"content marketing\" experts (no, no clickbaits titles and boobs as images) and I am instead going direct to the point of why I'm here. When I was a teen-ager, after all, trying to pick up ladies following the gurus' techniques has rarely proven to be more than an embarassment to myself. Why The noise/information ratio on the internet is already catastrophically high, and that's a reason why I don't have any social network account, but I still feel like I have something to say , and writing is quite a therapeutic act for me. I don't monetize the traffic, there are no ads here, I don't try to seduce the passerby. Beside that, I really need a place where to show my works, otherwise I could never propose myself as a designer, photographer or whatever. Contents will therefore be oriented towards environmental problems, like sweet water depletion, desertification, biodiversity loss, but I won't mind in touching less obviously related subjects such as intellectual property, linguistic, technology and more. I'll also try to document my projects, but I'm not in the business of reinventing the wheel . I will not write stuff you can already find elsewhere, and also for important informations, I may write them on wikipedia instead and come here just to celebrate. Who am I Frankly, I'm just a dude. I have a bachelor degree in herbalism, a permaculture designer certificate (yeah, the infamous PDC), I worked in farms and as IT, traveled and helped environmental projects for years. What does that mean, in all fairness? Not as much as it may seem. The only true important knowledge that I feel like I've accumulated in the years is the limits of my/our understanding of the world, how ignorant are we in front of the unexpectedness of nature and its complex, opaque causal relationships. Sometimes that ignites a bright wonder, other times my ignorance is quite of a downer. I don't pretend to know that much on any subject, and if I take some slips I am happy to be corrected, please let me know in a mail. Or just write me to tell me how handsome I am, and send me some money, why not :) This website From a technical point of view, this website is proudly done with pelican , a python-based static website generator, with pelican-bootstrap3 as theme, and is hosted by github pages. In another article I may go more indeep about the design choices for this website. Now, I broke the ice, hope we'll get along during my little adventure with this space","title":"First step"}]}